zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aux_timer2.h
//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH0CCFG
//
//*****************************************************************************
// Field:   [6:1] CAPT_SRC
//
// Select capture signal source from the asynchronous AUX event bus.
//
// The selected signal enters the edge-detection circuit. False capture events
// can occur when:
// - the edge-detection circuit contains expired signal samples and the circuit
// is enabled without flush as described in CH0EVCFG
// - this register is reconfigured while CTL.MODE is different from DIS.
//
// You can avoid false capture events. When wanted channel function is:
// - SET_ON_CAPT_DIS, see description for SET_ON_CAPT_DIS in CH0EVCFG.CCACT.
// - SET_ON_CAPT, see description for SET_ON_CAPT in CH0EVCFG.CCACT.
// - PER_PULSE_WIDTH_MEAS, see description for PER_PULSE_WIDTH_MEAS in
// CH0EVCFG.CCACT.
//
// If you write a non-enumerated value the behavior is identical to NO_EVENT.
// The written value is returned when read.
// ENUMs:
// NO_EVENT                 No event.
// AUX_SMPH_AUTOTAKE_DONE   AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             AUX_EVCTL:EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             AUX_EVCTL:EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV
// AUX_TIMER2_EV3           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
// AUX_COMPB                AUX_EVCTL:EVSTAT2.AUX_COMPB
// AUX_COMPA                AUX_EVCTL:EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              AUX_EVCTL:EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              AUX_EVCTL:EVSTAT2.MCU_OBSMUX0
// MCU_EV                   AUX_EVCTL:EVSTAT2.MCU_EV
// ACLK_REF                 AUX_EVCTL:EVSTAT2.ACLK_REF
// VDDR_RECHARGE            AUX_EVCTL:EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               AUX_EVCTL:EVSTAT2.MCU_ACTIVE
// PWR_DWN                  AUX_EVCTL:EVSTAT2.PWR_DWN
// SCLK_LF                  AUX_EVCTL:EVSTAT2.SCLK_LF
// AON_BATMON_TEMP_UPD      AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD
// AON_BATMON_BAT_UPD       AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD
// AON_RTC_4KHZ             AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              AUX_EVCTL:EVSTAT2.AON_RTC_CH2
// MANUAL_EV                AUX_EVCTL:EVSTAT2.MANUAL_EV
// AUXIO31                  AUX_EVCTL:EVSTAT1.AUXIO31
// AUXIO30                  AUX_EVCTL:EVSTAT1.AUXIO30
// AUXIO29                  AUX_EVCTL:EVSTAT1.AUXIO29
// AUXIO28                  AUX_EVCTL:EVSTAT1.AUXIO28
// AUXIO27                  AUX_EVCTL:EVSTAT1.AUXIO27
// AUXIO26                  AUX_EVCTL:EVSTAT1.AUXIO26
// AUXIO25                  AUX_EVCTL:EVSTAT1.AUXIO25
// AUXIO24                  AUX_EVCTL:EVSTAT1.AUXIO24
// AUXIO23                  AUX_EVCTL:EVSTAT1.AUXIO23
// AUXIO22                  AUX_EVCTL:EVSTAT1.AUXIO22
// AUXIO21                  AUX_EVCTL:EVSTAT1.AUXIO21
// AUXIO20                  AUX_EVCTL:EVSTAT1.AUXIO20
// AUXIO19                  AUX_EVCTL:EVSTAT1.AUXIO19
// AUXIO18                  AUX_EVCTL:EVSTAT1.AUXIO18
// AUXIO17                  AUX_EVCTL:EVSTAT1.AUXIO17
// AUXIO16                  AUX_EVCTL:EVSTAT1.AUXIO16
// AUXIO15                  AUX_EVCTL:EVSTAT0.AUXIO15
// AUXIO14                  AUX_EVCTL:EVSTAT0.AUXIO14
// AUXIO13                  AUX_EVCTL:EVSTAT0.AUXIO13
// AUXIO12                  AUX_EVCTL:EVSTAT0.AUXIO12
// AUXIO11                  AUX_EVCTL:EVSTAT0.AUXIO11
// AUXIO10                  AUX_EVCTL:EVSTAT0.AUXIO10
// AUXIO9                   AUX_EVCTL:EVSTAT0.AUXIO9
// AUXIO8                   AUX_EVCTL:EVSTAT0.AUXIO8
// AUXIO7                   AUX_EVCTL:EVSTAT0.AUXIO7
// AUXIO6                   AUX_EVCTL:EVSTAT0.AUXIO6
// AUXIO5                   AUX_EVCTL:EVSTAT0.AUXIO5
// AUXIO4                   AUX_EVCTL:EVSTAT0.AUXIO4
// AUXIO3                   AUX_EVCTL:EVSTAT0.AUXIO3
// AUXIO2                   AUX_EVCTL:EVSTAT0.AUXIO2
// AUXIO1                   AUX_EVCTL:EVSTAT0.AUXIO1
// AUXIO0                   AUX_EVCTL:EVSTAT0.AUXIO0
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_W                                        6
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_M                               0x0000007E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_S                                        1
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_NO_EVENT                        0x0000007E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_SMPH_AUTOTAKE_DONE          0x0000007A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_ADC_FIFO_NOT_EMPTY          0x00000078
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_ADC_FIFO_ALMOST_FULL        0x00000076
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_ADC_IRQ                     0x00000074
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_ADC_DONE                    0x00000072
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_ISRC_RESET_N                0x00000070
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TDC_DONE                    0x0000006E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TIMER0_EV                   0x0000006C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TIMER1_EV                   0x0000006A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TIMER2_EV3                  0x00000066
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TIMER2_EV2                  0x00000064
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TIMER2_EV1                  0x00000062
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_TIMER2_EV0                  0x00000060
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_COMPB                       0x0000005E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUX_COMPA                       0x0000005C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_MCU_OBSMUX1                     0x0000005A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_MCU_OBSMUX0                     0x00000058
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_MCU_EV                          0x00000056
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_ACLK_REF                        0x00000054
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_VDDR_RECHARGE                   0x00000052
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_MCU_ACTIVE                      0x00000050
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_PWR_DWN                         0x0000004E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_SCLK_LF                         0x0000004C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AON_BATMON_TEMP_UPD             0x0000004A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AON_BATMON_BAT_UPD              0x00000048
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AON_RTC_4KHZ                    0x00000046
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AON_RTC_CH2_DLY                 0x00000044
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AON_RTC_CH2                     0x00000042
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_MANUAL_EV                       0x00000040
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO31                         0x0000003E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO30                         0x0000003C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO29                         0x0000003A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO28                         0x00000038
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO27                         0x00000036
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO26                         0x00000034
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO25                         0x00000032
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO24                         0x00000030
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO23                         0x0000002E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO22                         0x0000002C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO21                         0x0000002A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO20                         0x00000028
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO19                         0x00000026
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO18                         0x00000024
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO17                         0x00000022
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO16                         0x00000020
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO15                         0x0000001E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO14                         0x0000001C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO13                         0x0000001A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO12                         0x00000018
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO11                         0x00000016
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO10                         0x00000014
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO9                          0x00000012
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO8                          0x00000010
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO7                          0x0000000E
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO6                          0x0000000C
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO5                          0x0000000A
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO4                          0x00000008
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO3                          0x00000006
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO2                          0x00000004
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO1                          0x00000002
#define AUX_TIMER2_CH0CCFG_CAPT_SRC_AUXIO0                          0x00000000

// Field:     [0] EDGE
//
// Edge configuration.
//
// Channel captures counter value at selected edge on signal source selected by
// CAPT_SRC. See CH0EVCFG.CCACT.
// ENUMs:
// RISING                   Capture CNTR.VALUE at rising edge of CAPT_SRC.
// FALLING                  Capture CNTR.VALUE at falling edge of CAPT_SRC.
#define AUX_TIMER2_CH0CCFG_EDGE                                     0x00000001
#define AUX_TIMER2_CH0CCFG_EDGE_BITN                                         0
#define AUX_TIMER2_CH0CCFG_EDGE_M                                   0x00000001
#define AUX_TIMER2_CH0CCFG_EDGE_S                                            0
#define AUX_TIMER2_CH0CCFG_EDGE_RISING                              0x00000001
#define AUX_TIMER2_CH0CCFG_EDGE_FALLING                             0x00000000

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH0PCC
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Pipeline Capture Compare value.
//
// 16-bit user defined pipeline compare value or channel-updated capture value.
//
// Compare mode:
// An update of VALUE will be transferred to CH0CC.VALUE when the next
// CNTR.VALUE is zero and CTL.MODE is different from DIS. This is useful for
// PWM generation and prevents jitter on the edges of the generated signal.
//
// Capture mode:
// When CH0EVCFG.CCACT equals PER_PULSE_WIDTH_MEAS then VALUE contains the
// width of the low or high phase of the selected signal. This is specified by
// CH0CCFG.EDGE and CH0CCFG.CAPT_SRC.
#define AUX_TIMER2_CH0PCC_VALUE_W                                           16
#define AUX_TIMER2_CH0PCC_VALUE_M                                   0x0000FFFF
#define AUX_TIMER2_CH0PCC_VALUE_S                                            0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH0CC
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Capture Compare value.
//
// 16-bit user defined compare value or channel-updated capture value.
//
// Compare mode:
// VALUE is compared against CNTR.VALUE and an event is generated as specified
// by CH0EVCFG.CCACT when these are equal.
//
// Capture mode:
// The current counter value is stored in VALUE when a capture event occurs.
// CH0EVCFG.CCACT determines if VALUE is a signal period or a regular capture
// value.
#define AUX_TIMER2_CH0CC_VALUE_W                                            16
#define AUX_TIMER2_CH0CC_VALUE_M                                    0x0000FFFF
#define AUX_TIMER2_CH0CC_VALUE_S                                             0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH1EVCFG
//
//*****************************************************************************
// Field:     [7] EV3_GEN
//
// Event 3 enable.
//
// 0: Channel 1 does not control event 3.
// 1: Channel 1 controls event 3.
//
//  When 0 < CCACT < 8, EV3_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH1EVCFG_EV3_GEN                                 0x00000080
#define AUX_TIMER2_CH1EVCFG_EV3_GEN_BITN                                     7
#define AUX_TIMER2_CH1EVCFG_EV3_GEN_M                               0x00000080
#define AUX_TIMER2_CH1EVCFG_EV3_GEN_S                                        7

// Field:     [6] EV2_GEN
//
// Event 2 enable.
//
// 0: Channel 1 does not control event 2.
// 1: Channel 1 controls event 2.
//
//  When 0 < CCACT < 8, EV2_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH1EVCFG_EV2_GEN                                 0x00000040
#define AUX_TIMER2_CH1EVCFG_EV2_GEN_BITN                                     6
#define AUX_TIMER2_CH1EVCFG_EV2_GEN_M                               0x00000040
#define AUX_TIMER2_CH1EVCFG_EV2_GEN_S                                        6

// Field:     [5] EV1_GEN
//
// Event 1 enable.
//
// 0: Channel 1 does not control event 1.
// 1: Channel 1 controls event 1.
//
//  When 0 < CCACT < 8, EV1_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH1EVCFG_EV1_GEN                                 0x00000020
#define AUX_TIMER2_CH1EVCFG_EV1_GEN_BITN                                     5
#define AUX_TIMER2_CH1EVCFG_EV1_GEN_M                               0x00000020
#define AUX_TIMER2_CH1EVCFG_EV1_GEN_S                                        5

// Field:     [4] EV0_GEN
//
// Event 0 enable.
//
// 0: Channel 1 does not control event 0.
// 1: Channel 1 controls event 0.
//
//  When 0 < CCACT < 8, EV0_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH1EVCFG_EV0_GEN                                 0x00000010
#define AUX_TIMER2_CH1EVCFG_EV0_GEN_BITN                                     4
#define AUX_TIMER2_CH1EVCFG_EV0_GEN_M                               0x00000010
#define AUX_TIMER2_CH1EVCFG_EV0_GEN_S                                        4

